{"data":{"allAboutMeJson":{"edges":[{"node":{"id":"1e68ae21-5c29-5faa-a0a5-8d6eae5bc0f8","dataId":"aboutMe","title":"About Me","description":"I'm a front-end developer with a BSc degree in computer science.<br/><br/>Whether it's creating interactive experiences out of UI designs,accelerating development with transpiling and build tools or discussing the latest front-end framework/library,it's curiosity that wakes me up in the morning (coffee also helps) and gets me excited for work.<br/><br/>After completing my BSc in CS, I started my career as a front-end developer at InfoMentorand I've been working ever since. The combination of graphic design education in high school,the odd graphic design project (using Photoshop and Illustrator) and computer science in universityhas been very useful in my day to day job. Especially when working with designers.<br/><br/>Even though I mainly work on the front-end,I have a great interest in most things related to software development and computer science. Keeping up to date on the latest technologies is something I love to do in my free time.","urls":{"profilePic":"assets/images/hrafnkell2.png","portfolioPdf":"assets/ferilskra-english.pdf"},"contactDetails":{"label":"Contact Details","name":"Hrafnkell Baldursson","address":"Bláhamrar","zip":"112","city":"Reykjavik","country":"Iceland","phone":"(354) 861-6532","email":"hrafnkell.baldursson@gmail.com"},"downloadResumeLabel":"Download Resume"}}]},"allExperienceJson":{"edges":[{"node":{"id":"b02f1c7f-2e68-5d5a-a394-3a685fdcaa8c","dataId":"infomentor-frontend","type":"work","iconSrc":"assets/images/infomentor.png","title":"InfoMentor","subtitle":"Front-end Developer","startDate":"2016-05-16","endDate":"2018-11-01","description":"Responsible for the development and maintenance of front-end solutions, as well as working closely with managers, stakeholders, designers and other developers through Scrum.<br/> I used Knockout.js, React.js, Node.js, SCSS, ASP.NET MVC and other tools to build stable and reliable solutions."}},{"node":{"id":"1b313152-8805-58a7-95ff-8b05f32e33a2","dataId":"ru-cs","type":"education","iconSrc":"assets/images/ru.svg","title":"Reykjavik University","subtitle":"Bachelor's Degree in Computer Science","startDate":"2013-08-20","endDate":"2016-06-01","description":"Software development with a focus on web development."}},{"node":{"id":"ba2b453c-a72f-5ae3-90c4-531b9840ab0f","dataId":"ru-intern","type":"work","iconSrc":"assets/images/ru.svg","title":"Reykjavik University","subtitle":"Internship","startDate":"2015-11-01","endDate":"2015-12-01","description":"A class I finished at RU called \"RU-Internship\" where students contributed to a new version of the university's intranet, called Centris.<br/> I contributed Web API and front-end design and implementation of the online exams in Centris"}}]}},"pageContext":{}}